/*
组合游戏：
(1)两个玩家
(2)有限的状态集合
(3)游戏的规则是指明状态转移
(4)有终态，且游戏会在有限步结束

因此状态集合可以看成有向无环图
方法：找到所有状态的 N/P态
P状态: 在此状态移动的玩家输
N状态：当前玩家赢
(1)先确定终态是 P or N 一般是 P（正常规则）
(2)根据最优策略，如果一个状态可以走到 P状态, 那么这个状态就是 N状态
(3)如果当前状态只能走到 N状态， 那么这个状态就是 P状态
N/P态确定后，最优策略也就确定出来了，P态由于怎么移动都只能到N态，因此随意移动就是最优策略
N态的最优策略是选择移动到任意一个P态
因此就可以统计某一个状态按照最优策略有几种走法，也可以统计游戏一共会出现几种走法/游戏结束的期望步数

因此可以dfs/dp/递推 出初态的 P/N ，如果初始是 N 那么先手赢，如果是 P，那么先手输
非 N,P 的问题，如操作花费少的胜利的题 可以设计dp某一状态的最大花费差 (cf 1527 B2)


总结: 递推/打表来确定所有状态的 N/P 性，如果时间复杂度不允许，那么再找规律
如何证明规律 ： 仍然是 N,P态的性质来分析，常用数学归纳法来证明
*/