/*
2.abc 280 E


概率是从起点到终点求 期望是从终点到起点求

1.给定n个点m条边的有向无环图 边一定是从编号小的点指向编号大的点 现在a在1号点 每次a随机选一条出边走
a会一直走直到他不能走为止 求能到达n号点的概率

 f[i] 表示从1号点到i号点的概率  f[1]=1, f[i] = sum(f[j]/deg[j]) j存在一条指向i的出边  O(n+m)

2.求到n号点的期望步数

  (1) 定义 f[i][j] 为从1号点走到i号点 恰好经过j条边的概率 答案就是 sum(f[n][i]*i) O(nm)
  (2) 定义 f[i] 从 i号点走到n号点的期望步数  f[n]=0  f[i] = sum(f[j]/deg[x]) + 1  j为i的出边指向的点  

3.到达n号点的期望步数 但是现在图不保证是无环的 也就是 边是任意的

   定义 f[i] 从 i号点走到n号点的期望步数  f[n]=0  f[i] = sum(f[j]/deg[x]) + 1 

   但是现在这个值并不能按某种顺序递推出来  我们要 求 n个变量 我们通过各条边知道 这n个变量之间的关系
   也就得到了线性方程组 因此高斯消元可以解决 复杂度 O(n^3)

4.cf 848 D
   给你一个长为n的01串 每次等概率选择一位翻转 问将01串变成全0的期望步数  n<=1e6

   f[i] 表示当前串有i个1 变成i-1个1的期望步数   有f[n]=1
   考虑i<n  f[i] = i/n * 1 + (1-i/n) * (1 + f[i+1] + f[i])
   整理可得   i * f[i] = n + (n-i) * f[i+1]
   假设给定串有cnt个1   res = sum(f[i]) i from 1 to cnt 
  
5.niuke 小白月赛67 E
   a想买一款游戏 在 1 - n 天 第i天 这款游戏的价格 等概率的为 ai 和 bi
   每天早上  这款游戏的价格会公布(ai or bi) a可以选择买或者不买
   询问在买到游戏的前提下 考虑最优策略 期望会花多少钱

   倒推  f[i] 表示 假设考虑 在 i - n 天 买 期望花的钱
   f[n] = (a[n]+b[n]) / 2 ;
   f[i] 假设 这一天的价格是 ai 那么 根据最优策略 如果 ai > f[i+1] 他不会在这一天买 反之 会买
         bi 同理
   因此  f[i] = 0.5 * min(a[i],f[i+1]) + 0.5 * min(b[i],f[i+1]);
*/