/*
有两种物品 A B 分别为 a 个 和 b 个 ,每次取3个物品 要求3个物品不能是同一种 
问最多能取多少次 


假设 a <= b
1. b >= 2a 每次取 2B  1A 可取 a 次 而最多可取的次数一定不会超过 a,因为每次取至少包含 1个 A
   因此答案是 a
2. b < 2a  答案必然满足 ans <= (a + b) / 3  满足
    每次选择剩下多的-2 另一个-1 考虑最终局面 
    因为 b < 2a 因此最终两种 最多 差 1
    0 0     0 1    1 0   1 1  都满足取等 
    不会出现 0 2     0 3 这种

因此 ans = min ( a , (a + b) / 3 );

有三种物品 A B C  a b c 个  每次取3个物品 要求3个物品不能是同一种 
1.c >= 2*(a+b)  显然答案是 a+b
2.c < 2*(a+b)  将 A 和 B 合成一类  d=a+b  c     c < 2*d  并且 d < 2*c 
    每次在两类里取三个物品 满足题意 由上面知 能取到等号
    而 ans <= (a + b + c) / 3
    因此 max = (a + b + c) / 3

ans = min(a + b ,(a + b + c) / 3);

cf 273 C
*/